# ####################################################################

#  Created by Genus(TM) Synthesis Solution 20.11-s111_1 on Sat Apr 25 21:37:05 IST 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design systolic_array_top

create_clock -name "sys_clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_load -pin_load 0.05 [get_ports done]
set_load -pin_load 0.05 [get_ports {C_flattened[1023]}]
set_load -pin_load 0.05 [get_ports {C_flattened[1022]}]
set_load -pin_load 0.05 [get_ports {C_flattened[1021]}]
set_load -pin_load 0.05 [get_ports {C_flattened[1020]}]
set_load -pin_load 0.05 [get_ports {C_flattened[1019]}]
set_load -pin_load 0.05 [get_ports {C_flattened[1018]}]
set_load -pin_load 0.05 [get_ports {C_flattened[1017]}]
set_load -pin_load 0.05 [get_ports {C_flattened[1016]}]
set_load -pin_load 0.05 [get_ports {C_flattened[1015]}]
set_load -pin_load 0.05 [get_ports {C_flattened[1014]}]
set_load -pin_load 0.05 [get_ports {C_flattened[1013]}]
set_load -pin_load 0.05 [get_ports {C_flattened[1012]}]
set_load -pin_load 0.05 [get_ports {C_flattened[1011]}]
set_load -pin_load 0.05 [get_ports {C_flattened[1010]}]
set_load -pin_load 0.05 [get_ports {C_flattened[1009]}]
set_load -pin_load 0.05 [get_ports {C_flattened[1008]}]
set_load -pin_load 0.05 [get_ports {C_flattened[1007]}]
set_load -pin_load 0.05 [get_ports {C_flattened[1006]}]
set_load -pin_load 0.05 [get_ports {C_flattened[1005]}]
set_load -pin_load 0.05 [get_ports {C_flattened[1004]}]
set_load -pin_load 0.05 [get_ports {C_flattened[1003]}]
set_load -pin_load 0.05 [get_ports {C_flattened[1002]}]
set_load -pin_load 0.05 [get_ports {C_flattened[1001]}]
set_load -pin_load 0.05 [get_ports {C_flattened[1000]}]
set_load -pin_load 0.05 [get_ports {C_flattened[999]}]
set_load -pin_load 0.05 [get_ports {C_flattened[998]}]
set_load -pin_load 0.05 [get_ports {C_flattened[997]}]
set_load -pin_load 0.05 [get_ports {C_flattened[996]}]
set_load -pin_load 0.05 [get_ports {C_flattened[995]}]
set_load -pin_load 0.05 [get_ports {C_flattened[994]}]
set_load -pin_load 0.05 [get_ports {C_flattened[993]}]
set_load -pin_load 0.05 [get_ports {C_flattened[992]}]
set_load -pin_load 0.05 [get_ports {C_flattened[991]}]
set_load -pin_load 0.05 [get_ports {C_flattened[990]}]
set_load -pin_load 0.05 [get_ports {C_flattened[989]}]
set_load -pin_load 0.05 [get_ports {C_flattened[988]}]
set_load -pin_load 0.05 [get_ports {C_flattened[987]}]
set_load -pin_load 0.05 [get_ports {C_flattened[986]}]
set_load -pin_load 0.05 [get_ports {C_flattened[985]}]
set_load -pin_load 0.05 [get_ports {C_flattened[984]}]
set_load -pin_load 0.05 [get_ports {C_flattened[983]}]
set_load -pin_load 0.05 [get_ports {C_flattened[982]}]
set_load -pin_load 0.05 [get_ports {C_flattened[981]}]
set_load -pin_load 0.05 [get_ports {C_flattened[980]}]
set_load -pin_load 0.05 [get_ports {C_flattened[979]}]
set_load -pin_load 0.05 [get_ports {C_flattened[978]}]
set_load -pin_load 0.05 [get_ports {C_flattened[977]}]
set_load -pin_load 0.05 [get_ports {C_flattened[976]}]
set_load -pin_load 0.05 [get_ports {C_flattened[975]}]
set_load -pin_load 0.05 [get_ports {C_flattened[974]}]
set_load -pin_load 0.05 [get_ports {C_flattened[973]}]
set_load -pin_load 0.05 [get_ports {C_flattened[972]}]
set_load -pin_load 0.05 [get_ports {C_flattened[971]}]
set_load -pin_load 0.05 [get_ports {C_flattened[970]}]
set_load -pin_load 0.05 [get_ports {C_flattened[969]}]
set_load -pin_load 0.05 [get_ports {C_flattened[968]}]
set_load -pin_load 0.05 [get_ports {C_flattened[967]}]
set_load -pin_load 0.05 [get_ports {C_flattened[966]}]
set_load -pin_load 0.05 [get_ports {C_flattened[965]}]
set_load -pin_load 0.05 [get_ports {C_flattened[964]}]
set_load -pin_load 0.05 [get_ports {C_flattened[963]}]
set_load -pin_load 0.05 [get_ports {C_flattened[962]}]
set_load -pin_load 0.05 [get_ports {C_flattened[961]}]
set_load -pin_load 0.05 [get_ports {C_flattened[960]}]
set_load -pin_load 0.05 [get_ports {C_flattened[959]}]
set_load -pin_load 0.05 [get_ports {C_flattened[958]}]
set_load -pin_load 0.05 [get_ports {C_flattened[957]}]
set_load -pin_load 0.05 [get_ports {C_flattened[956]}]
set_load -pin_load 0.05 [get_ports {C_flattened[955]}]
set_load -pin_load 0.05 [get_ports {C_flattened[954]}]
set_load -pin_load 0.05 [get_ports {C_flattened[953]}]
set_load -pin_load 0.05 [get_ports {C_flattened[952]}]
set_load -pin_load 0.05 [get_ports {C_flattened[951]}]
set_load -pin_load 0.05 [get_ports {C_flattened[950]}]
set_load -pin_load 0.05 [get_ports {C_flattened[949]}]
set_load -pin_load 0.05 [get_ports {C_flattened[948]}]
set_load -pin_load 0.05 [get_ports {C_flattened[947]}]
set_load -pin_load 0.05 [get_ports {C_flattened[946]}]
set_load -pin_load 0.05 [get_ports {C_flattened[945]}]
set_load -pin_load 0.05 [get_ports {C_flattened[944]}]
set_load -pin_load 0.05 [get_ports {C_flattened[943]}]
set_load -pin_load 0.05 [get_ports {C_flattened[942]}]
set_load -pin_load 0.05 [get_ports {C_flattened[941]}]
set_load -pin_load 0.05 [get_ports {C_flattened[940]}]
set_load -pin_load 0.05 [get_ports {C_flattened[939]}]
set_load -pin_load 0.05 [get_ports {C_flattened[938]}]
set_load -pin_load 0.05 [get_ports {C_flattened[937]}]
set_load -pin_load 0.05 [get_ports {C_flattened[936]}]
set_load -pin_load 0.05 [get_ports {C_flattened[935]}]
set_load -pin_load 0.05 [get_ports {C_flattened[934]}]
set_load -pin_load 0.05 [get_ports {C_flattened[933]}]
set_load -pin_load 0.05 [get_ports {C_flattened[932]}]
set_load -pin_load 0.05 [get_ports {C_flattened[931]}]
set_load -pin_load 0.05 [get_ports {C_flattened[930]}]
set_load -pin_load 0.05 [get_ports {C_flattened[929]}]
set_load -pin_load 0.05 [get_ports {C_flattened[928]}]
set_load -pin_load 0.05 [get_ports {C_flattened[927]}]
set_load -pin_load 0.05 [get_ports {C_flattened[926]}]
set_load -pin_load 0.05 [get_ports {C_flattened[925]}]
set_load -pin_load 0.05 [get_ports {C_flattened[924]}]
set_load -pin_load 0.05 [get_ports {C_flattened[923]}]
set_load -pin_load 0.05 [get_ports {C_flattened[922]}]
set_load -pin_load 0.05 [get_ports {C_flattened[921]}]
set_load -pin_load 0.05 [get_ports {C_flattened[920]}]
set_load -pin_load 0.05 [get_ports {C_flattened[919]}]
set_load -pin_load 0.05 [get_ports {C_flattened[918]}]
set_load -pin_load 0.05 [get_ports {C_flattened[917]}]
set_load -pin_load 0.05 [get_ports {C_flattened[916]}]
set_load -pin_load 0.05 [get_ports {C_flattened[915]}]
set_load -pin_load 0.05 [get_ports {C_flattened[914]}]
set_load -pin_load 0.05 [get_ports {C_flattened[913]}]
set_load -pin_load 0.05 [get_ports {C_flattened[912]}]
set_load -pin_load 0.05 [get_ports {C_flattened[911]}]
set_load -pin_load 0.05 [get_ports {C_flattened[910]}]
set_load -pin_load 0.05 [get_ports {C_flattened[909]}]
set_load -pin_load 0.05 [get_ports {C_flattened[908]}]
set_load -pin_load 0.05 [get_ports {C_flattened[907]}]
set_load -pin_load 0.05 [get_ports {C_flattened[906]}]
set_load -pin_load 0.05 [get_ports {C_flattened[905]}]
set_load -pin_load 0.05 [get_ports {C_flattened[904]}]
set_load -pin_load 0.05 [get_ports {C_flattened[903]}]
set_load -pin_load 0.05 [get_ports {C_flattened[902]}]
set_load -pin_load 0.05 [get_ports {C_flattened[901]}]
set_load -pin_load 0.05 [get_ports {C_flattened[900]}]
set_load -pin_load 0.05 [get_ports {C_flattened[899]}]
set_load -pin_load 0.05 [get_ports {C_flattened[898]}]
set_load -pin_load 0.05 [get_ports {C_flattened[897]}]
set_load -pin_load 0.05 [get_ports {C_flattened[896]}]
set_load -pin_load 0.05 [get_ports {C_flattened[895]}]
set_load -pin_load 0.05 [get_ports {C_flattened[894]}]
set_load -pin_load 0.05 [get_ports {C_flattened[893]}]
set_load -pin_load 0.05 [get_ports {C_flattened[892]}]
set_load -pin_load 0.05 [get_ports {C_flattened[891]}]
set_load -pin_load 0.05 [get_ports {C_flattened[890]}]
set_load -pin_load 0.05 [get_ports {C_flattened[889]}]
set_load -pin_load 0.05 [get_ports {C_flattened[888]}]
set_load -pin_load 0.05 [get_ports {C_flattened[887]}]
set_load -pin_load 0.05 [get_ports {C_flattened[886]}]
set_load -pin_load 0.05 [get_ports {C_flattened[885]}]
set_load -pin_load 0.05 [get_ports {C_flattened[884]}]
set_load -pin_load 0.05 [get_ports {C_flattened[883]}]
set_load -pin_load 0.05 [get_ports {C_flattened[882]}]
set_load -pin_load 0.05 [get_ports {C_flattened[881]}]
set_load -pin_load 0.05 [get_ports {C_flattened[880]}]
set_load -pin_load 0.05 [get_ports {C_flattened[879]}]
set_load -pin_load 0.05 [get_ports {C_flattened[878]}]
set_load -pin_load 0.05 [get_ports {C_flattened[877]}]
set_load -pin_load 0.05 [get_ports {C_flattened[876]}]
set_load -pin_load 0.05 [get_ports {C_flattened[875]}]
set_load -pin_load 0.05 [get_ports {C_flattened[874]}]
set_load -pin_load 0.05 [get_ports {C_flattened[873]}]
set_load -pin_load 0.05 [get_ports {C_flattened[872]}]
set_load -pin_load 0.05 [get_ports {C_flattened[871]}]
set_load -pin_load 0.05 [get_ports {C_flattened[870]}]
set_load -pin_load 0.05 [get_ports {C_flattened[869]}]
set_load -pin_load 0.05 [get_ports {C_flattened[868]}]
set_load -pin_load 0.05 [get_ports {C_flattened[867]}]
set_load -pin_load 0.05 [get_ports {C_flattened[866]}]
set_load -pin_load 0.05 [get_ports {C_flattened[865]}]
set_load -pin_load 0.05 [get_ports {C_flattened[864]}]
set_load -pin_load 0.05 [get_ports {C_flattened[863]}]
set_load -pin_load 0.05 [get_ports {C_flattened[862]}]
set_load -pin_load 0.05 [get_ports {C_flattened[861]}]
set_load -pin_load 0.05 [get_ports {C_flattened[860]}]
set_load -pin_load 0.05 [get_ports {C_flattened[859]}]
set_load -pin_load 0.05 [get_ports {C_flattened[858]}]
set_load -pin_load 0.05 [get_ports {C_flattened[857]}]
set_load -pin_load 0.05 [get_ports {C_flattened[856]}]
set_load -pin_load 0.05 [get_ports {C_flattened[855]}]
set_load -pin_load 0.05 [get_ports {C_flattened[854]}]
set_load -pin_load 0.05 [get_ports {C_flattened[853]}]
set_load -pin_load 0.05 [get_ports {C_flattened[852]}]
set_load -pin_load 0.05 [get_ports {C_flattened[851]}]
set_load -pin_load 0.05 [get_ports {C_flattened[850]}]
set_load -pin_load 0.05 [get_ports {C_flattened[849]}]
set_load -pin_load 0.05 [get_ports {C_flattened[848]}]
set_load -pin_load 0.05 [get_ports {C_flattened[847]}]
set_load -pin_load 0.05 [get_ports {C_flattened[846]}]
set_load -pin_load 0.05 [get_ports {C_flattened[845]}]
set_load -pin_load 0.05 [get_ports {C_flattened[844]}]
set_load -pin_load 0.05 [get_ports {C_flattened[843]}]
set_load -pin_load 0.05 [get_ports {C_flattened[842]}]
set_load -pin_load 0.05 [get_ports {C_flattened[841]}]
set_load -pin_load 0.05 [get_ports {C_flattened[840]}]
set_load -pin_load 0.05 [get_ports {C_flattened[839]}]
set_load -pin_load 0.05 [get_ports {C_flattened[838]}]
set_load -pin_load 0.05 [get_ports {C_flattened[837]}]
set_load -pin_load 0.05 [get_ports {C_flattened[836]}]
set_load -pin_load 0.05 [get_ports {C_flattened[835]}]
set_load -pin_load 0.05 [get_ports {C_flattened[834]}]
set_load -pin_load 0.05 [get_ports {C_flattened[833]}]
set_load -pin_load 0.05 [get_ports {C_flattened[832]}]
set_load -pin_load 0.05 [get_ports {C_flattened[831]}]
set_load -pin_load 0.05 [get_ports {C_flattened[830]}]
set_load -pin_load 0.05 [get_ports {C_flattened[829]}]
set_load -pin_load 0.05 [get_ports {C_flattened[828]}]
set_load -pin_load 0.05 [get_ports {C_flattened[827]}]
set_load -pin_load 0.05 [get_ports {C_flattened[826]}]
set_load -pin_load 0.05 [get_ports {C_flattened[825]}]
set_load -pin_load 0.05 [get_ports {C_flattened[824]}]
set_load -pin_load 0.05 [get_ports {C_flattened[823]}]
set_load -pin_load 0.05 [get_ports {C_flattened[822]}]
set_load -pin_load 0.05 [get_ports {C_flattened[821]}]
set_load -pin_load 0.05 [get_ports {C_flattened[820]}]
set_load -pin_load 0.05 [get_ports {C_flattened[819]}]
set_load -pin_load 0.05 [get_ports {C_flattened[818]}]
set_load -pin_load 0.05 [get_ports {C_flattened[817]}]
set_load -pin_load 0.05 [get_ports {C_flattened[816]}]
set_load -pin_load 0.05 [get_ports {C_flattened[815]}]
set_load -pin_load 0.05 [get_ports {C_flattened[814]}]
set_load -pin_load 0.05 [get_ports {C_flattened[813]}]
set_load -pin_load 0.05 [get_ports {C_flattened[812]}]
set_load -pin_load 0.05 [get_ports {C_flattened[811]}]
set_load -pin_load 0.05 [get_ports {C_flattened[810]}]
set_load -pin_load 0.05 [get_ports {C_flattened[809]}]
set_load -pin_load 0.05 [get_ports {C_flattened[808]}]
set_load -pin_load 0.05 [get_ports {C_flattened[807]}]
set_load -pin_load 0.05 [get_ports {C_flattened[806]}]
set_load -pin_load 0.05 [get_ports {C_flattened[805]}]
set_load -pin_load 0.05 [get_ports {C_flattened[804]}]
set_load -pin_load 0.05 [get_ports {C_flattened[803]}]
set_load -pin_load 0.05 [get_ports {C_flattened[802]}]
set_load -pin_load 0.05 [get_ports {C_flattened[801]}]
set_load -pin_load 0.05 [get_ports {C_flattened[800]}]
set_load -pin_load 0.05 [get_ports {C_flattened[799]}]
set_load -pin_load 0.05 [get_ports {C_flattened[798]}]
set_load -pin_load 0.05 [get_ports {C_flattened[797]}]
set_load -pin_load 0.05 [get_ports {C_flattened[796]}]
set_load -pin_load 0.05 [get_ports {C_flattened[795]}]
set_load -pin_load 0.05 [get_ports {C_flattened[794]}]
set_load -pin_load 0.05 [get_ports {C_flattened[793]}]
set_load -pin_load 0.05 [get_ports {C_flattened[792]}]
set_load -pin_load 0.05 [get_ports {C_flattened[791]}]
set_load -pin_load 0.05 [get_ports {C_flattened[790]}]
set_load -pin_load 0.05 [get_ports {C_flattened[789]}]
set_load -pin_load 0.05 [get_ports {C_flattened[788]}]
set_load -pin_load 0.05 [get_ports {C_flattened[787]}]
set_load -pin_load 0.05 [get_ports {C_flattened[786]}]
set_load -pin_load 0.05 [get_ports {C_flattened[785]}]
set_load -pin_load 0.05 [get_ports {C_flattened[784]}]
set_load -pin_load 0.05 [get_ports {C_flattened[783]}]
set_load -pin_load 0.05 [get_ports {C_flattened[782]}]
set_load -pin_load 0.05 [get_ports {C_flattened[781]}]
set_load -pin_load 0.05 [get_ports {C_flattened[780]}]
set_load -pin_load 0.05 [get_ports {C_flattened[779]}]
set_load -pin_load 0.05 [get_ports {C_flattened[778]}]
set_load -pin_load 0.05 [get_ports {C_flattened[777]}]
set_load -pin_load 0.05 [get_ports {C_flattened[776]}]
set_load -pin_load 0.05 [get_ports {C_flattened[775]}]
set_load -pin_load 0.05 [get_ports {C_flattened[774]}]
set_load -pin_load 0.05 [get_ports {C_flattened[773]}]
set_load -pin_load 0.05 [get_ports {C_flattened[772]}]
set_load -pin_load 0.05 [get_ports {C_flattened[771]}]
set_load -pin_load 0.05 [get_ports {C_flattened[770]}]
set_load -pin_load 0.05 [get_ports {C_flattened[769]}]
set_load -pin_load 0.05 [get_ports {C_flattened[768]}]
set_load -pin_load 0.05 [get_ports {C_flattened[767]}]
set_load -pin_load 0.05 [get_ports {C_flattened[766]}]
set_load -pin_load 0.05 [get_ports {C_flattened[765]}]
set_load -pin_load 0.05 [get_ports {C_flattened[764]}]
set_load -pin_load 0.05 [get_ports {C_flattened[763]}]
set_load -pin_load 0.05 [get_ports {C_flattened[762]}]
set_load -pin_load 0.05 [get_ports {C_flattened[761]}]
set_load -pin_load 0.05 [get_ports {C_flattened[760]}]
set_load -pin_load 0.05 [get_ports {C_flattened[759]}]
set_load -pin_load 0.05 [get_ports {C_flattened[758]}]
set_load -pin_load 0.05 [get_ports {C_flattened[757]}]
set_load -pin_load 0.05 [get_ports {C_flattened[756]}]
set_load -pin_load 0.05 [get_ports {C_flattened[755]}]
set_load -pin_load 0.05 [get_ports {C_flattened[754]}]
set_load -pin_load 0.05 [get_ports {C_flattened[753]}]
set_load -pin_load 0.05 [get_ports {C_flattened[752]}]
set_load -pin_load 0.05 [get_ports {C_flattened[751]}]
set_load -pin_load 0.05 [get_ports {C_flattened[750]}]
set_load -pin_load 0.05 [get_ports {C_flattened[749]}]
set_load -pin_load 0.05 [get_ports {C_flattened[748]}]
set_load -pin_load 0.05 [get_ports {C_flattened[747]}]
set_load -pin_load 0.05 [get_ports {C_flattened[746]}]
set_load -pin_load 0.05 [get_ports {C_flattened[745]}]
set_load -pin_load 0.05 [get_ports {C_flattened[744]}]
set_load -pin_load 0.05 [get_ports {C_flattened[743]}]
set_load -pin_load 0.05 [get_ports {C_flattened[742]}]
set_load -pin_load 0.05 [get_ports {C_flattened[741]}]
set_load -pin_load 0.05 [get_ports {C_flattened[740]}]
set_load -pin_load 0.05 [get_ports {C_flattened[739]}]
set_load -pin_load 0.05 [get_ports {C_flattened[738]}]
set_load -pin_load 0.05 [get_ports {C_flattened[737]}]
set_load -pin_load 0.05 [get_ports {C_flattened[736]}]
set_load -pin_load 0.05 [get_ports {C_flattened[735]}]
set_load -pin_load 0.05 [get_ports {C_flattened[734]}]
set_load -pin_load 0.05 [get_ports {C_flattened[733]}]
set_load -pin_load 0.05 [get_ports {C_flattened[732]}]
set_load -pin_load 0.05 [get_ports {C_flattened[731]}]
set_load -pin_load 0.05 [get_ports {C_flattened[730]}]
set_load -pin_load 0.05 [get_ports {C_flattened[729]}]
set_load -pin_load 0.05 [get_ports {C_flattened[728]}]
set_load -pin_load 0.05 [get_ports {C_flattened[727]}]
set_load -pin_load 0.05 [get_ports {C_flattened[726]}]
set_load -pin_load 0.05 [get_ports {C_flattened[725]}]
set_load -pin_load 0.05 [get_ports {C_flattened[724]}]
set_load -pin_load 0.05 [get_ports {C_flattened[723]}]
set_load -pin_load 0.05 [get_ports {C_flattened[722]}]
set_load -pin_load 0.05 [get_ports {C_flattened[721]}]
set_load -pin_load 0.05 [get_ports {C_flattened[720]}]
set_load -pin_load 0.05 [get_ports {C_flattened[719]}]
set_load -pin_load 0.05 [get_ports {C_flattened[718]}]
set_load -pin_load 0.05 [get_ports {C_flattened[717]}]
set_load -pin_load 0.05 [get_ports {C_flattened[716]}]
set_load -pin_load 0.05 [get_ports {C_flattened[715]}]
set_load -pin_load 0.05 [get_ports {C_flattened[714]}]
set_load -pin_load 0.05 [get_ports {C_flattened[713]}]
set_load -pin_load 0.05 [get_ports {C_flattened[712]}]
set_load -pin_load 0.05 [get_ports {C_flattened[711]}]
set_load -pin_load 0.05 [get_ports {C_flattened[710]}]
set_load -pin_load 0.05 [get_ports {C_flattened[709]}]
set_load -pin_load 0.05 [get_ports {C_flattened[708]}]
set_load -pin_load 0.05 [get_ports {C_flattened[707]}]
set_load -pin_load 0.05 [get_ports {C_flattened[706]}]
set_load -pin_load 0.05 [get_ports {C_flattened[705]}]
set_load -pin_load 0.05 [get_ports {C_flattened[704]}]
set_load -pin_load 0.05 [get_ports {C_flattened[703]}]
set_load -pin_load 0.05 [get_ports {C_flattened[702]}]
set_load -pin_load 0.05 [get_ports {C_flattened[701]}]
set_load -pin_load 0.05 [get_ports {C_flattened[700]}]
set_load -pin_load 0.05 [get_ports {C_flattened[699]}]
set_load -pin_load 0.05 [get_ports {C_flattened[698]}]
set_load -pin_load 0.05 [get_ports {C_flattened[697]}]
set_load -pin_load 0.05 [get_ports {C_flattened[696]}]
set_load -pin_load 0.05 [get_ports {C_flattened[695]}]
set_load -pin_load 0.05 [get_ports {C_flattened[694]}]
set_load -pin_load 0.05 [get_ports {C_flattened[693]}]
set_load -pin_load 0.05 [get_ports {C_flattened[692]}]
set_load -pin_load 0.05 [get_ports {C_flattened[691]}]
set_load -pin_load 0.05 [get_ports {C_flattened[690]}]
set_load -pin_load 0.05 [get_ports {C_flattened[689]}]
set_load -pin_load 0.05 [get_ports {C_flattened[688]}]
set_load -pin_load 0.05 [get_ports {C_flattened[687]}]
set_load -pin_load 0.05 [get_ports {C_flattened[686]}]
set_load -pin_load 0.05 [get_ports {C_flattened[685]}]
set_load -pin_load 0.05 [get_ports {C_flattened[684]}]
set_load -pin_load 0.05 [get_ports {C_flattened[683]}]
set_load -pin_load 0.05 [get_ports {C_flattened[682]}]
set_load -pin_load 0.05 [get_ports {C_flattened[681]}]
set_load -pin_load 0.05 [get_ports {C_flattened[680]}]
set_load -pin_load 0.05 [get_ports {C_flattened[679]}]
set_load -pin_load 0.05 [get_ports {C_flattened[678]}]
set_load -pin_load 0.05 [get_ports {C_flattened[677]}]
set_load -pin_load 0.05 [get_ports {C_flattened[676]}]
set_load -pin_load 0.05 [get_ports {C_flattened[675]}]
set_load -pin_load 0.05 [get_ports {C_flattened[674]}]
set_load -pin_load 0.05 [get_ports {C_flattened[673]}]
set_load -pin_load 0.05 [get_ports {C_flattened[672]}]
set_load -pin_load 0.05 [get_ports {C_flattened[671]}]
set_load -pin_load 0.05 [get_ports {C_flattened[670]}]
set_load -pin_load 0.05 [get_ports {C_flattened[669]}]
set_load -pin_load 0.05 [get_ports {C_flattened[668]}]
set_load -pin_load 0.05 [get_ports {C_flattened[667]}]
set_load -pin_load 0.05 [get_ports {C_flattened[666]}]
set_load -pin_load 0.05 [get_ports {C_flattened[665]}]
set_load -pin_load 0.05 [get_ports {C_flattened[664]}]
set_load -pin_load 0.05 [get_ports {C_flattened[663]}]
set_load -pin_load 0.05 [get_ports {C_flattened[662]}]
set_load -pin_load 0.05 [get_ports {C_flattened[661]}]
set_load -pin_load 0.05 [get_ports {C_flattened[660]}]
set_load -pin_load 0.05 [get_ports {C_flattened[659]}]
set_load -pin_load 0.05 [get_ports {C_flattened[658]}]
set_load -pin_load 0.05 [get_ports {C_flattened[657]}]
set_load -pin_load 0.05 [get_ports {C_flattened[656]}]
set_load -pin_load 0.05 [get_ports {C_flattened[655]}]
set_load -pin_load 0.05 [get_ports {C_flattened[654]}]
set_load -pin_load 0.05 [get_ports {C_flattened[653]}]
set_load -pin_load 0.05 [get_ports {C_flattened[652]}]
set_load -pin_load 0.05 [get_ports {C_flattened[651]}]
set_load -pin_load 0.05 [get_ports {C_flattened[650]}]
set_load -pin_load 0.05 [get_ports {C_flattened[649]}]
set_load -pin_load 0.05 [get_ports {C_flattened[648]}]
set_load -pin_load 0.05 [get_ports {C_flattened[647]}]
set_load -pin_load 0.05 [get_ports {C_flattened[646]}]
set_load -pin_load 0.05 [get_ports {C_flattened[645]}]
set_load -pin_load 0.05 [get_ports {C_flattened[644]}]
set_load -pin_load 0.05 [get_ports {C_flattened[643]}]
set_load -pin_load 0.05 [get_ports {C_flattened[642]}]
set_load -pin_load 0.05 [get_ports {C_flattened[641]}]
set_load -pin_load 0.05 [get_ports {C_flattened[640]}]
set_load -pin_load 0.05 [get_ports {C_flattened[639]}]
set_load -pin_load 0.05 [get_ports {C_flattened[638]}]
set_load -pin_load 0.05 [get_ports {C_flattened[637]}]
set_load -pin_load 0.05 [get_ports {C_flattened[636]}]
set_load -pin_load 0.05 [get_ports {C_flattened[635]}]
set_load -pin_load 0.05 [get_ports {C_flattened[634]}]
set_load -pin_load 0.05 [get_ports {C_flattened[633]}]
set_load -pin_load 0.05 [get_ports {C_flattened[632]}]
set_load -pin_load 0.05 [get_ports {C_flattened[631]}]
set_load -pin_load 0.05 [get_ports {C_flattened[630]}]
set_load -pin_load 0.05 [get_ports {C_flattened[629]}]
set_load -pin_load 0.05 [get_ports {C_flattened[628]}]
set_load -pin_load 0.05 [get_ports {C_flattened[627]}]
set_load -pin_load 0.05 [get_ports {C_flattened[626]}]
set_load -pin_load 0.05 [get_ports {C_flattened[625]}]
set_load -pin_load 0.05 [get_ports {C_flattened[624]}]
set_load -pin_load 0.05 [get_ports {C_flattened[623]}]
set_load -pin_load 0.05 [get_ports {C_flattened[622]}]
set_load -pin_load 0.05 [get_ports {C_flattened[621]}]
set_load -pin_load 0.05 [get_ports {C_flattened[620]}]
set_load -pin_load 0.05 [get_ports {C_flattened[619]}]
set_load -pin_load 0.05 [get_ports {C_flattened[618]}]
set_load -pin_load 0.05 [get_ports {C_flattened[617]}]
set_load -pin_load 0.05 [get_ports {C_flattened[616]}]
set_load -pin_load 0.05 [get_ports {C_flattened[615]}]
set_load -pin_load 0.05 [get_ports {C_flattened[614]}]
set_load -pin_load 0.05 [get_ports {C_flattened[613]}]
set_load -pin_load 0.05 [get_ports {C_flattened[612]}]
set_load -pin_load 0.05 [get_ports {C_flattened[611]}]
set_load -pin_load 0.05 [get_ports {C_flattened[610]}]
set_load -pin_load 0.05 [get_ports {C_flattened[609]}]
set_load -pin_load 0.05 [get_ports {C_flattened[608]}]
set_load -pin_load 0.05 [get_ports {C_flattened[607]}]
set_load -pin_load 0.05 [get_ports {C_flattened[606]}]
set_load -pin_load 0.05 [get_ports {C_flattened[605]}]
set_load -pin_load 0.05 [get_ports {C_flattened[604]}]
set_load -pin_load 0.05 [get_ports {C_flattened[603]}]
set_load -pin_load 0.05 [get_ports {C_flattened[602]}]
set_load -pin_load 0.05 [get_ports {C_flattened[601]}]
set_load -pin_load 0.05 [get_ports {C_flattened[600]}]
set_load -pin_load 0.05 [get_ports {C_flattened[599]}]
set_load -pin_load 0.05 [get_ports {C_flattened[598]}]
set_load -pin_load 0.05 [get_ports {C_flattened[597]}]
set_load -pin_load 0.05 [get_ports {C_flattened[596]}]
set_load -pin_load 0.05 [get_ports {C_flattened[595]}]
set_load -pin_load 0.05 [get_ports {C_flattened[594]}]
set_load -pin_load 0.05 [get_ports {C_flattened[593]}]
set_load -pin_load 0.05 [get_ports {C_flattened[592]}]
set_load -pin_load 0.05 [get_ports {C_flattened[591]}]
set_load -pin_load 0.05 [get_ports {C_flattened[590]}]
set_load -pin_load 0.05 [get_ports {C_flattened[589]}]
set_load -pin_load 0.05 [get_ports {C_flattened[588]}]
set_load -pin_load 0.05 [get_ports {C_flattened[587]}]
set_load -pin_load 0.05 [get_ports {C_flattened[586]}]
set_load -pin_load 0.05 [get_ports {C_flattened[585]}]
set_load -pin_load 0.05 [get_ports {C_flattened[584]}]
set_load -pin_load 0.05 [get_ports {C_flattened[583]}]
set_load -pin_load 0.05 [get_ports {C_flattened[582]}]
set_load -pin_load 0.05 [get_ports {C_flattened[581]}]
set_load -pin_load 0.05 [get_ports {C_flattened[580]}]
set_load -pin_load 0.05 [get_ports {C_flattened[579]}]
set_load -pin_load 0.05 [get_ports {C_flattened[578]}]
set_load -pin_load 0.05 [get_ports {C_flattened[577]}]
set_load -pin_load 0.05 [get_ports {C_flattened[576]}]
set_load -pin_load 0.05 [get_ports {C_flattened[575]}]
set_load -pin_load 0.05 [get_ports {C_flattened[574]}]
set_load -pin_load 0.05 [get_ports {C_flattened[573]}]
set_load -pin_load 0.05 [get_ports {C_flattened[572]}]
set_load -pin_load 0.05 [get_ports {C_flattened[571]}]
set_load -pin_load 0.05 [get_ports {C_flattened[570]}]
set_load -pin_load 0.05 [get_ports {C_flattened[569]}]
set_load -pin_load 0.05 [get_ports {C_flattened[568]}]
set_load -pin_load 0.05 [get_ports {C_flattened[567]}]
set_load -pin_load 0.05 [get_ports {C_flattened[566]}]
set_load -pin_load 0.05 [get_ports {C_flattened[565]}]
set_load -pin_load 0.05 [get_ports {C_flattened[564]}]
set_load -pin_load 0.05 [get_ports {C_flattened[563]}]
set_load -pin_load 0.05 [get_ports {C_flattened[562]}]
set_load -pin_load 0.05 [get_ports {C_flattened[561]}]
set_load -pin_load 0.05 [get_ports {C_flattened[560]}]
set_load -pin_load 0.05 [get_ports {C_flattened[559]}]
set_load -pin_load 0.05 [get_ports {C_flattened[558]}]
set_load -pin_load 0.05 [get_ports {C_flattened[557]}]
set_load -pin_load 0.05 [get_ports {C_flattened[556]}]
set_load -pin_load 0.05 [get_ports {C_flattened[555]}]
set_load -pin_load 0.05 [get_ports {C_flattened[554]}]
set_load -pin_load 0.05 [get_ports {C_flattened[553]}]
set_load -pin_load 0.05 [get_ports {C_flattened[552]}]
set_load -pin_load 0.05 [get_ports {C_flattened[551]}]
set_load -pin_load 0.05 [get_ports {C_flattened[550]}]
set_load -pin_load 0.05 [get_ports {C_flattened[549]}]
set_load -pin_load 0.05 [get_ports {C_flattened[548]}]
set_load -pin_load 0.05 [get_ports {C_flattened[547]}]
set_load -pin_load 0.05 [get_ports {C_flattened[546]}]
set_load -pin_load 0.05 [get_ports {C_flattened[545]}]
set_load -pin_load 0.05 [get_ports {C_flattened[544]}]
set_load -pin_load 0.05 [get_ports {C_flattened[543]}]
set_load -pin_load 0.05 [get_ports {C_flattened[542]}]
set_load -pin_load 0.05 [get_ports {C_flattened[541]}]
set_load -pin_load 0.05 [get_ports {C_flattened[540]}]
set_load -pin_load 0.05 [get_ports {C_flattened[539]}]
set_load -pin_load 0.05 [get_ports {C_flattened[538]}]
set_load -pin_load 0.05 [get_ports {C_flattened[537]}]
set_load -pin_load 0.05 [get_ports {C_flattened[536]}]
set_load -pin_load 0.05 [get_ports {C_flattened[535]}]
set_load -pin_load 0.05 [get_ports {C_flattened[534]}]
set_load -pin_load 0.05 [get_ports {C_flattened[533]}]
set_load -pin_load 0.05 [get_ports {C_flattened[532]}]
set_load -pin_load 0.05 [get_ports {C_flattened[531]}]
set_load -pin_load 0.05 [get_ports {C_flattened[530]}]
set_load -pin_load 0.05 [get_ports {C_flattened[529]}]
set_load -pin_load 0.05 [get_ports {C_flattened[528]}]
set_load -pin_load 0.05 [get_ports {C_flattened[527]}]
set_load -pin_load 0.05 [get_ports {C_flattened[526]}]
set_load -pin_load 0.05 [get_ports {C_flattened[525]}]
set_load -pin_load 0.05 [get_ports {C_flattened[524]}]
set_load -pin_load 0.05 [get_ports {C_flattened[523]}]
set_load -pin_load 0.05 [get_ports {C_flattened[522]}]
set_load -pin_load 0.05 [get_ports {C_flattened[521]}]
set_load -pin_load 0.05 [get_ports {C_flattened[520]}]
set_load -pin_load 0.05 [get_ports {C_flattened[519]}]
set_load -pin_load 0.05 [get_ports {C_flattened[518]}]
set_load -pin_load 0.05 [get_ports {C_flattened[517]}]
set_load -pin_load 0.05 [get_ports {C_flattened[516]}]
set_load -pin_load 0.05 [get_ports {C_flattened[515]}]
set_load -pin_load 0.05 [get_ports {C_flattened[514]}]
set_load -pin_load 0.05 [get_ports {C_flattened[513]}]
set_load -pin_load 0.05 [get_ports {C_flattened[512]}]
set_load -pin_load 0.05 [get_ports {C_flattened[511]}]
set_load -pin_load 0.05 [get_ports {C_flattened[510]}]
set_load -pin_load 0.05 [get_ports {C_flattened[509]}]
set_load -pin_load 0.05 [get_ports {C_flattened[508]}]
set_load -pin_load 0.05 [get_ports {C_flattened[507]}]
set_load -pin_load 0.05 [get_ports {C_flattened[506]}]
set_load -pin_load 0.05 [get_ports {C_flattened[505]}]
set_load -pin_load 0.05 [get_ports {C_flattened[504]}]
set_load -pin_load 0.05 [get_ports {C_flattened[503]}]
set_load -pin_load 0.05 [get_ports {C_flattened[502]}]
set_load -pin_load 0.05 [get_ports {C_flattened[501]}]
set_load -pin_load 0.05 [get_ports {C_flattened[500]}]
set_load -pin_load 0.05 [get_ports {C_flattened[499]}]
set_load -pin_load 0.05 [get_ports {C_flattened[498]}]
set_load -pin_load 0.05 [get_ports {C_flattened[497]}]
set_load -pin_load 0.05 [get_ports {C_flattened[496]}]
set_load -pin_load 0.05 [get_ports {C_flattened[495]}]
set_load -pin_load 0.05 [get_ports {C_flattened[494]}]
set_load -pin_load 0.05 [get_ports {C_flattened[493]}]
set_load -pin_load 0.05 [get_ports {C_flattened[492]}]
set_load -pin_load 0.05 [get_ports {C_flattened[491]}]
set_load -pin_load 0.05 [get_ports {C_flattened[490]}]
set_load -pin_load 0.05 [get_ports {C_flattened[489]}]
set_load -pin_load 0.05 [get_ports {C_flattened[488]}]
set_load -pin_load 0.05 [get_ports {C_flattened[487]}]
set_load -pin_load 0.05 [get_ports {C_flattened[486]}]
set_load -pin_load 0.05 [get_ports {C_flattened[485]}]
set_load -pin_load 0.05 [get_ports {C_flattened[484]}]
set_load -pin_load 0.05 [get_ports {C_flattened[483]}]
set_load -pin_load 0.05 [get_ports {C_flattened[482]}]
set_load -pin_load 0.05 [get_ports {C_flattened[481]}]
set_load -pin_load 0.05 [get_ports {C_flattened[480]}]
set_load -pin_load 0.05 [get_ports {C_flattened[479]}]
set_load -pin_load 0.05 [get_ports {C_flattened[478]}]
set_load -pin_load 0.05 [get_ports {C_flattened[477]}]
set_load -pin_load 0.05 [get_ports {C_flattened[476]}]
set_load -pin_load 0.05 [get_ports {C_flattened[475]}]
set_load -pin_load 0.05 [get_ports {C_flattened[474]}]
set_load -pin_load 0.05 [get_ports {C_flattened[473]}]
set_load -pin_load 0.05 [get_ports {C_flattened[472]}]
set_load -pin_load 0.05 [get_ports {C_flattened[471]}]
set_load -pin_load 0.05 [get_ports {C_flattened[470]}]
set_load -pin_load 0.05 [get_ports {C_flattened[469]}]
set_load -pin_load 0.05 [get_ports {C_flattened[468]}]
set_load -pin_load 0.05 [get_ports {C_flattened[467]}]
set_load -pin_load 0.05 [get_ports {C_flattened[466]}]
set_load -pin_load 0.05 [get_ports {C_flattened[465]}]
set_load -pin_load 0.05 [get_ports {C_flattened[464]}]
set_load -pin_load 0.05 [get_ports {C_flattened[463]}]
set_load -pin_load 0.05 [get_ports {C_flattened[462]}]
set_load -pin_load 0.05 [get_ports {C_flattened[461]}]
set_load -pin_load 0.05 [get_ports {C_flattened[460]}]
set_load -pin_load 0.05 [get_ports {C_flattened[459]}]
set_load -pin_load 0.05 [get_ports {C_flattened[458]}]
set_load -pin_load 0.05 [get_ports {C_flattened[457]}]
set_load -pin_load 0.05 [get_ports {C_flattened[456]}]
set_load -pin_load 0.05 [get_ports {C_flattened[455]}]
set_load -pin_load 0.05 [get_ports {C_flattened[454]}]
set_load -pin_load 0.05 [get_ports {C_flattened[453]}]
set_load -pin_load 0.05 [get_ports {C_flattened[452]}]
set_load -pin_load 0.05 [get_ports {C_flattened[451]}]
set_load -pin_load 0.05 [get_ports {C_flattened[450]}]
set_load -pin_load 0.05 [get_ports {C_flattened[449]}]
set_load -pin_load 0.05 [get_ports {C_flattened[448]}]
set_load -pin_load 0.05 [get_ports {C_flattened[447]}]
set_load -pin_load 0.05 [get_ports {C_flattened[446]}]
set_load -pin_load 0.05 [get_ports {C_flattened[445]}]
set_load -pin_load 0.05 [get_ports {C_flattened[444]}]
set_load -pin_load 0.05 [get_ports {C_flattened[443]}]
set_load -pin_load 0.05 [get_ports {C_flattened[442]}]
set_load -pin_load 0.05 [get_ports {C_flattened[441]}]
set_load -pin_load 0.05 [get_ports {C_flattened[440]}]
set_load -pin_load 0.05 [get_ports {C_flattened[439]}]
set_load -pin_load 0.05 [get_ports {C_flattened[438]}]
set_load -pin_load 0.05 [get_ports {C_flattened[437]}]
set_load -pin_load 0.05 [get_ports {C_flattened[436]}]
set_load -pin_load 0.05 [get_ports {C_flattened[435]}]
set_load -pin_load 0.05 [get_ports {C_flattened[434]}]
set_load -pin_load 0.05 [get_ports {C_flattened[433]}]
set_load -pin_load 0.05 [get_ports {C_flattened[432]}]
set_load -pin_load 0.05 [get_ports {C_flattened[431]}]
set_load -pin_load 0.05 [get_ports {C_flattened[430]}]
set_load -pin_load 0.05 [get_ports {C_flattened[429]}]
set_load -pin_load 0.05 [get_ports {C_flattened[428]}]
set_load -pin_load 0.05 [get_ports {C_flattened[427]}]
set_load -pin_load 0.05 [get_ports {C_flattened[426]}]
set_load -pin_load 0.05 [get_ports {C_flattened[425]}]
set_load -pin_load 0.05 [get_ports {C_flattened[424]}]
set_load -pin_load 0.05 [get_ports {C_flattened[423]}]
set_load -pin_load 0.05 [get_ports {C_flattened[422]}]
set_load -pin_load 0.05 [get_ports {C_flattened[421]}]
set_load -pin_load 0.05 [get_ports {C_flattened[420]}]
set_load -pin_load 0.05 [get_ports {C_flattened[419]}]
set_load -pin_load 0.05 [get_ports {C_flattened[418]}]
set_load -pin_load 0.05 [get_ports {C_flattened[417]}]
set_load -pin_load 0.05 [get_ports {C_flattened[416]}]
set_load -pin_load 0.05 [get_ports {C_flattened[415]}]
set_load -pin_load 0.05 [get_ports {C_flattened[414]}]
set_load -pin_load 0.05 [get_ports {C_flattened[413]}]
set_load -pin_load 0.05 [get_ports {C_flattened[412]}]
set_load -pin_load 0.05 [get_ports {C_flattened[411]}]
set_load -pin_load 0.05 [get_ports {C_flattened[410]}]
set_load -pin_load 0.05 [get_ports {C_flattened[409]}]
set_load -pin_load 0.05 [get_ports {C_flattened[408]}]
set_load -pin_load 0.05 [get_ports {C_flattened[407]}]
set_load -pin_load 0.05 [get_ports {C_flattened[406]}]
set_load -pin_load 0.05 [get_ports {C_flattened[405]}]
set_load -pin_load 0.05 [get_ports {C_flattened[404]}]
set_load -pin_load 0.05 [get_ports {C_flattened[403]}]
set_load -pin_load 0.05 [get_ports {C_flattened[402]}]
set_load -pin_load 0.05 [get_ports {C_flattened[401]}]
set_load -pin_load 0.05 [get_ports {C_flattened[400]}]
set_load -pin_load 0.05 [get_ports {C_flattened[399]}]
set_load -pin_load 0.05 [get_ports {C_flattened[398]}]
set_load -pin_load 0.05 [get_ports {C_flattened[397]}]
set_load -pin_load 0.05 [get_ports {C_flattened[396]}]
set_load -pin_load 0.05 [get_ports {C_flattened[395]}]
set_load -pin_load 0.05 [get_ports {C_flattened[394]}]
set_load -pin_load 0.05 [get_ports {C_flattened[393]}]
set_load -pin_load 0.05 [get_ports {C_flattened[392]}]
set_load -pin_load 0.05 [get_ports {C_flattened[391]}]
set_load -pin_load 0.05 [get_ports {C_flattened[390]}]
set_load -pin_load 0.05 [get_ports {C_flattened[389]}]
set_load -pin_load 0.05 [get_ports {C_flattened[388]}]
set_load -pin_load 0.05 [get_ports {C_flattened[387]}]
set_load -pin_load 0.05 [get_ports {C_flattened[386]}]
set_load -pin_load 0.05 [get_ports {C_flattened[385]}]
set_load -pin_load 0.05 [get_ports {C_flattened[384]}]
set_load -pin_load 0.05 [get_ports {C_flattened[383]}]
set_load -pin_load 0.05 [get_ports {C_flattened[382]}]
set_load -pin_load 0.05 [get_ports {C_flattened[381]}]
set_load -pin_load 0.05 [get_ports {C_flattened[380]}]
set_load -pin_load 0.05 [get_ports {C_flattened[379]}]
set_load -pin_load 0.05 [get_ports {C_flattened[378]}]
set_load -pin_load 0.05 [get_ports {C_flattened[377]}]
set_load -pin_load 0.05 [get_ports {C_flattened[376]}]
set_load -pin_load 0.05 [get_ports {C_flattened[375]}]
set_load -pin_load 0.05 [get_ports {C_flattened[374]}]
set_load -pin_load 0.05 [get_ports {C_flattened[373]}]
set_load -pin_load 0.05 [get_ports {C_flattened[372]}]
set_load -pin_load 0.05 [get_ports {C_flattened[371]}]
set_load -pin_load 0.05 [get_ports {C_flattened[370]}]
set_load -pin_load 0.05 [get_ports {C_flattened[369]}]
set_load -pin_load 0.05 [get_ports {C_flattened[368]}]
set_load -pin_load 0.05 [get_ports {C_flattened[367]}]
set_load -pin_load 0.05 [get_ports {C_flattened[366]}]
set_load -pin_load 0.05 [get_ports {C_flattened[365]}]
set_load -pin_load 0.05 [get_ports {C_flattened[364]}]
set_load -pin_load 0.05 [get_ports {C_flattened[363]}]
set_load -pin_load 0.05 [get_ports {C_flattened[362]}]
set_load -pin_load 0.05 [get_ports {C_flattened[361]}]
set_load -pin_load 0.05 [get_ports {C_flattened[360]}]
set_load -pin_load 0.05 [get_ports {C_flattened[359]}]
set_load -pin_load 0.05 [get_ports {C_flattened[358]}]
set_load -pin_load 0.05 [get_ports {C_flattened[357]}]
set_load -pin_load 0.05 [get_ports {C_flattened[356]}]
set_load -pin_load 0.05 [get_ports {C_flattened[355]}]
set_load -pin_load 0.05 [get_ports {C_flattened[354]}]
set_load -pin_load 0.05 [get_ports {C_flattened[353]}]
set_load -pin_load 0.05 [get_ports {C_flattened[352]}]
set_load -pin_load 0.05 [get_ports {C_flattened[351]}]
set_load -pin_load 0.05 [get_ports {C_flattened[350]}]
set_load -pin_load 0.05 [get_ports {C_flattened[349]}]
set_load -pin_load 0.05 [get_ports {C_flattened[348]}]
set_load -pin_load 0.05 [get_ports {C_flattened[347]}]
set_load -pin_load 0.05 [get_ports {C_flattened[346]}]
set_load -pin_load 0.05 [get_ports {C_flattened[345]}]
set_load -pin_load 0.05 [get_ports {C_flattened[344]}]
set_load -pin_load 0.05 [get_ports {C_flattened[343]}]
set_load -pin_load 0.05 [get_ports {C_flattened[342]}]
set_load -pin_load 0.05 [get_ports {C_flattened[341]}]
set_load -pin_load 0.05 [get_ports {C_flattened[340]}]
set_load -pin_load 0.05 [get_ports {C_flattened[339]}]
set_load -pin_load 0.05 [get_ports {C_flattened[338]}]
set_load -pin_load 0.05 [get_ports {C_flattened[337]}]
set_load -pin_load 0.05 [get_ports {C_flattened[336]}]
set_load -pin_load 0.05 [get_ports {C_flattened[335]}]
set_load -pin_load 0.05 [get_ports {C_flattened[334]}]
set_load -pin_load 0.05 [get_ports {C_flattened[333]}]
set_load -pin_load 0.05 [get_ports {C_flattened[332]}]
set_load -pin_load 0.05 [get_ports {C_flattened[331]}]
set_load -pin_load 0.05 [get_ports {C_flattened[330]}]
set_load -pin_load 0.05 [get_ports {C_flattened[329]}]
set_load -pin_load 0.05 [get_ports {C_flattened[328]}]
set_load -pin_load 0.05 [get_ports {C_flattened[327]}]
set_load -pin_load 0.05 [get_ports {C_flattened[326]}]
set_load -pin_load 0.05 [get_ports {C_flattened[325]}]
set_load -pin_load 0.05 [get_ports {C_flattened[324]}]
set_load -pin_load 0.05 [get_ports {C_flattened[323]}]
set_load -pin_load 0.05 [get_ports {C_flattened[322]}]
set_load -pin_load 0.05 [get_ports {C_flattened[321]}]
set_load -pin_load 0.05 [get_ports {C_flattened[320]}]
set_load -pin_load 0.05 [get_ports {C_flattened[319]}]
set_load -pin_load 0.05 [get_ports {C_flattened[318]}]
set_load -pin_load 0.05 [get_ports {C_flattened[317]}]
set_load -pin_load 0.05 [get_ports {C_flattened[316]}]
set_load -pin_load 0.05 [get_ports {C_flattened[315]}]
set_load -pin_load 0.05 [get_ports {C_flattened[314]}]
set_load -pin_load 0.05 [get_ports {C_flattened[313]}]
set_load -pin_load 0.05 [get_ports {C_flattened[312]}]
set_load -pin_load 0.05 [get_ports {C_flattened[311]}]
set_load -pin_load 0.05 [get_ports {C_flattened[310]}]
set_load -pin_load 0.05 [get_ports {C_flattened[309]}]
set_load -pin_load 0.05 [get_ports {C_flattened[308]}]
set_load -pin_load 0.05 [get_ports {C_flattened[307]}]
set_load -pin_load 0.05 [get_ports {C_flattened[306]}]
set_load -pin_load 0.05 [get_ports {C_flattened[305]}]
set_load -pin_load 0.05 [get_ports {C_flattened[304]}]
set_load -pin_load 0.05 [get_ports {C_flattened[303]}]
set_load -pin_load 0.05 [get_ports {C_flattened[302]}]
set_load -pin_load 0.05 [get_ports {C_flattened[301]}]
set_load -pin_load 0.05 [get_ports {C_flattened[300]}]
set_load -pin_load 0.05 [get_ports {C_flattened[299]}]
set_load -pin_load 0.05 [get_ports {C_flattened[298]}]
set_load -pin_load 0.05 [get_ports {C_flattened[297]}]
set_load -pin_load 0.05 [get_ports {C_flattened[296]}]
set_load -pin_load 0.05 [get_ports {C_flattened[295]}]
set_load -pin_load 0.05 [get_ports {C_flattened[294]}]
set_load -pin_load 0.05 [get_ports {C_flattened[293]}]
set_load -pin_load 0.05 [get_ports {C_flattened[292]}]
set_load -pin_load 0.05 [get_ports {C_flattened[291]}]
set_load -pin_load 0.05 [get_ports {C_flattened[290]}]
set_load -pin_load 0.05 [get_ports {C_flattened[289]}]
set_load -pin_load 0.05 [get_ports {C_flattened[288]}]
set_load -pin_load 0.05 [get_ports {C_flattened[287]}]
set_load -pin_load 0.05 [get_ports {C_flattened[286]}]
set_load -pin_load 0.05 [get_ports {C_flattened[285]}]
set_load -pin_load 0.05 [get_ports {C_flattened[284]}]
set_load -pin_load 0.05 [get_ports {C_flattened[283]}]
set_load -pin_load 0.05 [get_ports {C_flattened[282]}]
set_load -pin_load 0.05 [get_ports {C_flattened[281]}]
set_load -pin_load 0.05 [get_ports {C_flattened[280]}]
set_load -pin_load 0.05 [get_ports {C_flattened[279]}]
set_load -pin_load 0.05 [get_ports {C_flattened[278]}]
set_load -pin_load 0.05 [get_ports {C_flattened[277]}]
set_load -pin_load 0.05 [get_ports {C_flattened[276]}]
set_load -pin_load 0.05 [get_ports {C_flattened[275]}]
set_load -pin_load 0.05 [get_ports {C_flattened[274]}]
set_load -pin_load 0.05 [get_ports {C_flattened[273]}]
set_load -pin_load 0.05 [get_ports {C_flattened[272]}]
set_load -pin_load 0.05 [get_ports {C_flattened[271]}]
set_load -pin_load 0.05 [get_ports {C_flattened[270]}]
set_load -pin_load 0.05 [get_ports {C_flattened[269]}]
set_load -pin_load 0.05 [get_ports {C_flattened[268]}]
set_load -pin_load 0.05 [get_ports {C_flattened[267]}]
set_load -pin_load 0.05 [get_ports {C_flattened[266]}]
set_load -pin_load 0.05 [get_ports {C_flattened[265]}]
set_load -pin_load 0.05 [get_ports {C_flattened[264]}]
set_load -pin_load 0.05 [get_ports {C_flattened[263]}]
set_load -pin_load 0.05 [get_ports {C_flattened[262]}]
set_load -pin_load 0.05 [get_ports {C_flattened[261]}]
set_load -pin_load 0.05 [get_ports {C_flattened[260]}]
set_load -pin_load 0.05 [get_ports {C_flattened[259]}]
set_load -pin_load 0.05 [get_ports {C_flattened[258]}]
set_load -pin_load 0.05 [get_ports {C_flattened[257]}]
set_load -pin_load 0.05 [get_ports {C_flattened[256]}]
set_load -pin_load 0.05 [get_ports {C_flattened[255]}]
set_load -pin_load 0.05 [get_ports {C_flattened[254]}]
set_load -pin_load 0.05 [get_ports {C_flattened[253]}]
set_load -pin_load 0.05 [get_ports {C_flattened[252]}]
set_load -pin_load 0.05 [get_ports {C_flattened[251]}]
set_load -pin_load 0.05 [get_ports {C_flattened[250]}]
set_load -pin_load 0.05 [get_ports {C_flattened[249]}]
set_load -pin_load 0.05 [get_ports {C_flattened[248]}]
set_load -pin_load 0.05 [get_ports {C_flattened[247]}]
set_load -pin_load 0.05 [get_ports {C_flattened[246]}]
set_load -pin_load 0.05 [get_ports {C_flattened[245]}]
set_load -pin_load 0.05 [get_ports {C_flattened[244]}]
set_load -pin_load 0.05 [get_ports {C_flattened[243]}]
set_load -pin_load 0.05 [get_ports {C_flattened[242]}]
set_load -pin_load 0.05 [get_ports {C_flattened[241]}]
set_load -pin_load 0.05 [get_ports {C_flattened[240]}]
set_load -pin_load 0.05 [get_ports {C_flattened[239]}]
set_load -pin_load 0.05 [get_ports {C_flattened[238]}]
set_load -pin_load 0.05 [get_ports {C_flattened[237]}]
set_load -pin_load 0.05 [get_ports {C_flattened[236]}]
set_load -pin_load 0.05 [get_ports {C_flattened[235]}]
set_load -pin_load 0.05 [get_ports {C_flattened[234]}]
set_load -pin_load 0.05 [get_ports {C_flattened[233]}]
set_load -pin_load 0.05 [get_ports {C_flattened[232]}]
set_load -pin_load 0.05 [get_ports {C_flattened[231]}]
set_load -pin_load 0.05 [get_ports {C_flattened[230]}]
set_load -pin_load 0.05 [get_ports {C_flattened[229]}]
set_load -pin_load 0.05 [get_ports {C_flattened[228]}]
set_load -pin_load 0.05 [get_ports {C_flattened[227]}]
set_load -pin_load 0.05 [get_ports {C_flattened[226]}]
set_load -pin_load 0.05 [get_ports {C_flattened[225]}]
set_load -pin_load 0.05 [get_ports {C_flattened[224]}]
set_load -pin_load 0.05 [get_ports {C_flattened[223]}]
set_load -pin_load 0.05 [get_ports {C_flattened[222]}]
set_load -pin_load 0.05 [get_ports {C_flattened[221]}]
set_load -pin_load 0.05 [get_ports {C_flattened[220]}]
set_load -pin_load 0.05 [get_ports {C_flattened[219]}]
set_load -pin_load 0.05 [get_ports {C_flattened[218]}]
set_load -pin_load 0.05 [get_ports {C_flattened[217]}]
set_load -pin_load 0.05 [get_ports {C_flattened[216]}]
set_load -pin_load 0.05 [get_ports {C_flattened[215]}]
set_load -pin_load 0.05 [get_ports {C_flattened[214]}]
set_load -pin_load 0.05 [get_ports {C_flattened[213]}]
set_load -pin_load 0.05 [get_ports {C_flattened[212]}]
set_load -pin_load 0.05 [get_ports {C_flattened[211]}]
set_load -pin_load 0.05 [get_ports {C_flattened[210]}]
set_load -pin_load 0.05 [get_ports {C_flattened[209]}]
set_load -pin_load 0.05 [get_ports {C_flattened[208]}]
set_load -pin_load 0.05 [get_ports {C_flattened[207]}]
set_load -pin_load 0.05 [get_ports {C_flattened[206]}]
set_load -pin_load 0.05 [get_ports {C_flattened[205]}]
set_load -pin_load 0.05 [get_ports {C_flattened[204]}]
set_load -pin_load 0.05 [get_ports {C_flattened[203]}]
set_load -pin_load 0.05 [get_ports {C_flattened[202]}]
set_load -pin_load 0.05 [get_ports {C_flattened[201]}]
set_load -pin_load 0.05 [get_ports {C_flattened[200]}]
set_load -pin_load 0.05 [get_ports {C_flattened[199]}]
set_load -pin_load 0.05 [get_ports {C_flattened[198]}]
set_load -pin_load 0.05 [get_ports {C_flattened[197]}]
set_load -pin_load 0.05 [get_ports {C_flattened[196]}]
set_load -pin_load 0.05 [get_ports {C_flattened[195]}]
set_load -pin_load 0.05 [get_ports {C_flattened[194]}]
set_load -pin_load 0.05 [get_ports {C_flattened[193]}]
set_load -pin_load 0.05 [get_ports {C_flattened[192]}]
set_load -pin_load 0.05 [get_ports {C_flattened[191]}]
set_load -pin_load 0.05 [get_ports {C_flattened[190]}]
set_load -pin_load 0.05 [get_ports {C_flattened[189]}]
set_load -pin_load 0.05 [get_ports {C_flattened[188]}]
set_load -pin_load 0.05 [get_ports {C_flattened[187]}]
set_load -pin_load 0.05 [get_ports {C_flattened[186]}]
set_load -pin_load 0.05 [get_ports {C_flattened[185]}]
set_load -pin_load 0.05 [get_ports {C_flattened[184]}]
set_load -pin_load 0.05 [get_ports {C_flattened[183]}]
set_load -pin_load 0.05 [get_ports {C_flattened[182]}]
set_load -pin_load 0.05 [get_ports {C_flattened[181]}]
set_load -pin_load 0.05 [get_ports {C_flattened[180]}]
set_load -pin_load 0.05 [get_ports {C_flattened[179]}]
set_load -pin_load 0.05 [get_ports {C_flattened[178]}]
set_load -pin_load 0.05 [get_ports {C_flattened[177]}]
set_load -pin_load 0.05 [get_ports {C_flattened[176]}]
set_load -pin_load 0.05 [get_ports {C_flattened[175]}]
set_load -pin_load 0.05 [get_ports {C_flattened[174]}]
set_load -pin_load 0.05 [get_ports {C_flattened[173]}]
set_load -pin_load 0.05 [get_ports {C_flattened[172]}]
set_load -pin_load 0.05 [get_ports {C_flattened[171]}]
set_load -pin_load 0.05 [get_ports {C_flattened[170]}]
set_load -pin_load 0.05 [get_ports {C_flattened[169]}]
set_load -pin_load 0.05 [get_ports {C_flattened[168]}]
set_load -pin_load 0.05 [get_ports {C_flattened[167]}]
set_load -pin_load 0.05 [get_ports {C_flattened[166]}]
set_load -pin_load 0.05 [get_ports {C_flattened[165]}]
set_load -pin_load 0.05 [get_ports {C_flattened[164]}]
set_load -pin_load 0.05 [get_ports {C_flattened[163]}]
set_load -pin_load 0.05 [get_ports {C_flattened[162]}]
set_load -pin_load 0.05 [get_ports {C_flattened[161]}]
set_load -pin_load 0.05 [get_ports {C_flattened[160]}]
set_load -pin_load 0.05 [get_ports {C_flattened[159]}]
set_load -pin_load 0.05 [get_ports {C_flattened[158]}]
set_load -pin_load 0.05 [get_ports {C_flattened[157]}]
set_load -pin_load 0.05 [get_ports {C_flattened[156]}]
set_load -pin_load 0.05 [get_ports {C_flattened[155]}]
set_load -pin_load 0.05 [get_ports {C_flattened[154]}]
set_load -pin_load 0.05 [get_ports {C_flattened[153]}]
set_load -pin_load 0.05 [get_ports {C_flattened[152]}]
set_load -pin_load 0.05 [get_ports {C_flattened[151]}]
set_load -pin_load 0.05 [get_ports {C_flattened[150]}]
set_load -pin_load 0.05 [get_ports {C_flattened[149]}]
set_load -pin_load 0.05 [get_ports {C_flattened[148]}]
set_load -pin_load 0.05 [get_ports {C_flattened[147]}]
set_load -pin_load 0.05 [get_ports {C_flattened[146]}]
set_load -pin_load 0.05 [get_ports {C_flattened[145]}]
set_load -pin_load 0.05 [get_ports {C_flattened[144]}]
set_load -pin_load 0.05 [get_ports {C_flattened[143]}]
set_load -pin_load 0.05 [get_ports {C_flattened[142]}]
set_load -pin_load 0.05 [get_ports {C_flattened[141]}]
set_load -pin_load 0.05 [get_ports {C_flattened[140]}]
set_load -pin_load 0.05 [get_ports {C_flattened[139]}]
set_load -pin_load 0.05 [get_ports {C_flattened[138]}]
set_load -pin_load 0.05 [get_ports {C_flattened[137]}]
set_load -pin_load 0.05 [get_ports {C_flattened[136]}]
set_load -pin_load 0.05 [get_ports {C_flattened[135]}]
set_load -pin_load 0.05 [get_ports {C_flattened[134]}]
set_load -pin_load 0.05 [get_ports {C_flattened[133]}]
set_load -pin_load 0.05 [get_ports {C_flattened[132]}]
set_load -pin_load 0.05 [get_ports {C_flattened[131]}]
set_load -pin_load 0.05 [get_ports {C_flattened[130]}]
set_load -pin_load 0.05 [get_ports {C_flattened[129]}]
set_load -pin_load 0.05 [get_ports {C_flattened[128]}]
set_load -pin_load 0.05 [get_ports {C_flattened[127]}]
set_load -pin_load 0.05 [get_ports {C_flattened[126]}]
set_load -pin_load 0.05 [get_ports {C_flattened[125]}]
set_load -pin_load 0.05 [get_ports {C_flattened[124]}]
set_load -pin_load 0.05 [get_ports {C_flattened[123]}]
set_load -pin_load 0.05 [get_ports {C_flattened[122]}]
set_load -pin_load 0.05 [get_ports {C_flattened[121]}]
set_load -pin_load 0.05 [get_ports {C_flattened[120]}]
set_load -pin_load 0.05 [get_ports {C_flattened[119]}]
set_load -pin_load 0.05 [get_ports {C_flattened[118]}]
set_load -pin_load 0.05 [get_ports {C_flattened[117]}]
set_load -pin_load 0.05 [get_ports {C_flattened[116]}]
set_load -pin_load 0.05 [get_ports {C_flattened[115]}]
set_load -pin_load 0.05 [get_ports {C_flattened[114]}]
set_load -pin_load 0.05 [get_ports {C_flattened[113]}]
set_load -pin_load 0.05 [get_ports {C_flattened[112]}]
set_load -pin_load 0.05 [get_ports {C_flattened[111]}]
set_load -pin_load 0.05 [get_ports {C_flattened[110]}]
set_load -pin_load 0.05 [get_ports {C_flattened[109]}]
set_load -pin_load 0.05 [get_ports {C_flattened[108]}]
set_load -pin_load 0.05 [get_ports {C_flattened[107]}]
set_load -pin_load 0.05 [get_ports {C_flattened[106]}]
set_load -pin_load 0.05 [get_ports {C_flattened[105]}]
set_load -pin_load 0.05 [get_ports {C_flattened[104]}]
set_load -pin_load 0.05 [get_ports {C_flattened[103]}]
set_load -pin_load 0.05 [get_ports {C_flattened[102]}]
set_load -pin_load 0.05 [get_ports {C_flattened[101]}]
set_load -pin_load 0.05 [get_ports {C_flattened[100]}]
set_load -pin_load 0.05 [get_ports {C_flattened[99]}]
set_load -pin_load 0.05 [get_ports {C_flattened[98]}]
set_load -pin_load 0.05 [get_ports {C_flattened[97]}]
set_load -pin_load 0.05 [get_ports {C_flattened[96]}]
set_load -pin_load 0.05 [get_ports {C_flattened[95]}]
set_load -pin_load 0.05 [get_ports {C_flattened[94]}]
set_load -pin_load 0.05 [get_ports {C_flattened[93]}]
set_load -pin_load 0.05 [get_ports {C_flattened[92]}]
set_load -pin_load 0.05 [get_ports {C_flattened[91]}]
set_load -pin_load 0.05 [get_ports {C_flattened[90]}]
set_load -pin_load 0.05 [get_ports {C_flattened[89]}]
set_load -pin_load 0.05 [get_ports {C_flattened[88]}]
set_load -pin_load 0.05 [get_ports {C_flattened[87]}]
set_load -pin_load 0.05 [get_ports {C_flattened[86]}]
set_load -pin_load 0.05 [get_ports {C_flattened[85]}]
set_load -pin_load 0.05 [get_ports {C_flattened[84]}]
set_load -pin_load 0.05 [get_ports {C_flattened[83]}]
set_load -pin_load 0.05 [get_ports {C_flattened[82]}]
set_load -pin_load 0.05 [get_ports {C_flattened[81]}]
set_load -pin_load 0.05 [get_ports {C_flattened[80]}]
set_load -pin_load 0.05 [get_ports {C_flattened[79]}]
set_load -pin_load 0.05 [get_ports {C_flattened[78]}]
set_load -pin_load 0.05 [get_ports {C_flattened[77]}]
set_load -pin_load 0.05 [get_ports {C_flattened[76]}]
set_load -pin_load 0.05 [get_ports {C_flattened[75]}]
set_load -pin_load 0.05 [get_ports {C_flattened[74]}]
set_load -pin_load 0.05 [get_ports {C_flattened[73]}]
set_load -pin_load 0.05 [get_ports {C_flattened[72]}]
set_load -pin_load 0.05 [get_ports {C_flattened[71]}]
set_load -pin_load 0.05 [get_ports {C_flattened[70]}]
set_load -pin_load 0.05 [get_ports {C_flattened[69]}]
set_load -pin_load 0.05 [get_ports {C_flattened[68]}]
set_load -pin_load 0.05 [get_ports {C_flattened[67]}]
set_load -pin_load 0.05 [get_ports {C_flattened[66]}]
set_load -pin_load 0.05 [get_ports {C_flattened[65]}]
set_load -pin_load 0.05 [get_ports {C_flattened[64]}]
set_load -pin_load 0.05 [get_ports {C_flattened[63]}]
set_load -pin_load 0.05 [get_ports {C_flattened[62]}]
set_load -pin_load 0.05 [get_ports {C_flattened[61]}]
set_load -pin_load 0.05 [get_ports {C_flattened[60]}]
set_load -pin_load 0.05 [get_ports {C_flattened[59]}]
set_load -pin_load 0.05 [get_ports {C_flattened[58]}]
set_load -pin_load 0.05 [get_ports {C_flattened[57]}]
set_load -pin_load 0.05 [get_ports {C_flattened[56]}]
set_load -pin_load 0.05 [get_ports {C_flattened[55]}]
set_load -pin_load 0.05 [get_ports {C_flattened[54]}]
set_load -pin_load 0.05 [get_ports {C_flattened[53]}]
set_load -pin_load 0.05 [get_ports {C_flattened[52]}]
set_load -pin_load 0.05 [get_ports {C_flattened[51]}]
set_load -pin_load 0.05 [get_ports {C_flattened[50]}]
set_load -pin_load 0.05 [get_ports {C_flattened[49]}]
set_load -pin_load 0.05 [get_ports {C_flattened[48]}]
set_load -pin_load 0.05 [get_ports {C_flattened[47]}]
set_load -pin_load 0.05 [get_ports {C_flattened[46]}]
set_load -pin_load 0.05 [get_ports {C_flattened[45]}]
set_load -pin_load 0.05 [get_ports {C_flattened[44]}]
set_load -pin_load 0.05 [get_ports {C_flattened[43]}]
set_load -pin_load 0.05 [get_ports {C_flattened[42]}]
set_load -pin_load 0.05 [get_ports {C_flattened[41]}]
set_load -pin_load 0.05 [get_ports {C_flattened[40]}]
set_load -pin_load 0.05 [get_ports {C_flattened[39]}]
set_load -pin_load 0.05 [get_ports {C_flattened[38]}]
set_load -pin_load 0.05 [get_ports {C_flattened[37]}]
set_load -pin_load 0.05 [get_ports {C_flattened[36]}]
set_load -pin_load 0.05 [get_ports {C_flattened[35]}]
set_load -pin_load 0.05 [get_ports {C_flattened[34]}]
set_load -pin_load 0.05 [get_ports {C_flattened[33]}]
set_load -pin_load 0.05 [get_ports {C_flattened[32]}]
set_load -pin_load 0.05 [get_ports {C_flattened[31]}]
set_load -pin_load 0.05 [get_ports {C_flattened[30]}]
set_load -pin_load 0.05 [get_ports {C_flattened[29]}]
set_load -pin_load 0.05 [get_ports {C_flattened[28]}]
set_load -pin_load 0.05 [get_ports {C_flattened[27]}]
set_load -pin_load 0.05 [get_ports {C_flattened[26]}]
set_load -pin_load 0.05 [get_ports {C_flattened[25]}]
set_load -pin_load 0.05 [get_ports {C_flattened[24]}]
set_load -pin_load 0.05 [get_ports {C_flattened[23]}]
set_load -pin_load 0.05 [get_ports {C_flattened[22]}]
set_load -pin_load 0.05 [get_ports {C_flattened[21]}]
set_load -pin_load 0.05 [get_ports {C_flattened[20]}]
set_load -pin_load 0.05 [get_ports {C_flattened[19]}]
set_load -pin_load 0.05 [get_ports {C_flattened[18]}]
set_load -pin_load 0.05 [get_ports {C_flattened[17]}]
set_load -pin_load 0.05 [get_ports {C_flattened[16]}]
set_load -pin_load 0.05 [get_ports {C_flattened[15]}]
set_load -pin_load 0.05 [get_ports {C_flattened[14]}]
set_load -pin_load 0.05 [get_ports {C_flattened[13]}]
set_load -pin_load 0.05 [get_ports {C_flattened[12]}]
set_load -pin_load 0.05 [get_ports {C_flattened[11]}]
set_load -pin_load 0.05 [get_ports {C_flattened[10]}]
set_load -pin_load 0.05 [get_ports {C_flattened[9]}]
set_load -pin_load 0.05 [get_ports {C_flattened[8]}]
set_load -pin_load 0.05 [get_ports {C_flattened[7]}]
set_load -pin_load 0.05 [get_ports {C_flattened[6]}]
set_load -pin_load 0.05 [get_ports {C_flattened[5]}]
set_load -pin_load 0.05 [get_ports {C_flattened[4]}]
set_load -pin_load 0.05 [get_ports {C_flattened[3]}]
set_load -pin_load 0.05 [get_ports {C_flattened[2]}]
set_load -pin_load 0.05 [get_ports {C_flattened[1]}]
set_load -pin_load 0.05 [get_ports {C_flattened[0]}]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks sys_clk] -add_delay 2.0 [get_ports rst]
set_input_delay -clock [get_clocks sys_clk] -add_delay 2.0 [get_ports start]
set_output_delay -clock [get_clocks sys_clk] -add_delay 2.0 [get_ports done]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports clk]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports rst]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports start]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports {din[7]}]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports {din[6]}]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports {din[5]}]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports {din[4]}]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports {din[3]}]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports {din[2]}]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports {din[1]}]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports {din[0]}]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports {external_row_wr[7]}]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports {external_row_wr[6]}]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports {external_row_wr[5]}]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports {external_row_wr[4]}]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports {external_row_wr[3]}]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports {external_row_wr[2]}]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports {external_row_wr[1]}]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports {external_row_wr[0]}]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports {external_col_wr[7]}]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports {external_col_wr[6]}]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports {external_col_wr[5]}]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports {external_col_wr[4]}]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports {external_col_wr[3]}]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports {external_col_wr[2]}]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports {external_col_wr[1]}]
set_driving_cell -lib_cell BUFX2 -library fast -pin "Y" [get_ports {external_col_wr[0]}]
set_wire_load_mode "enclosed"
set_clock_uncertainty -setup 0.1 [get_clocks sys_clk]
set_clock_uncertainty -hold 0.1 [get_clocks sys_clk]
