###############################################################
#  Generated by:      Cadence Innovus 20.14-s095_1
#  OS:                Linux x86_64(Host ID lenovo-56.pilani.bits-pilani.ac.in)
#  Generated on:      Sat Apr 11 13:37:47 2026
#  Design:            systolic_array_top
###############################################################
current_design systolic_array_top
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name sys_clk -period 10.000000 -waveform {0.000000 5.000000}
set_propagated_clock  [get_clocks {sys_clk}]
set_propagated_clock  [get_ports {clk}]
set_wire_load_mode enclosed
set_input_delay -add_delay 2 -clock [get_clocks {sys_clk}] [get_ports {start}]
set_input_delay -add_delay 2 -clock [get_clocks {sys_clk}] [get_ports {rst}]
set_output_delay -add_delay 2 -clock [get_clocks {sys_clk}] [get_ports {done}]
set_clock_uncertainty 0.1 [get_clocks {sys_clk}]
set_clock_latency -source -early -max -rise  -0.457708 [get_ports {clk}] -clock sys_clk 
set_clock_latency -source -early -max -fall  -0.440895 [get_ports {clk}] -clock sys_clk 
set_clock_latency -source -late -max -rise  -0.457708 [get_ports {clk}] -clock sys_clk 
set_clock_latency -source -late -max -fall  -0.440895 [get_ports {clk}] -clock sys_clk 
